app/Controllers/Keluhan.php

    public function add()
    {
        $data = [
            'idpelanggan' => $this->request->getVar('idpelanggan'),
            'keluhan' =>  $this->request->getVar('keluhan'),
            'penyebab' =>  $this->request->getVar('penyebab'),
            'tindakan' =>  $this->request->getVar('tindakan'),
            'tgl_keluhan' =>  $this->request->getVar('tgl_keluhan'),
            'tgl_perbaikan' =>  $this->request->getVar('tgl_perbaikan'),
            'idteknisi' =>  $this->request->getVar('idteknisi'),
        ];
        $this->keluhan->insert($data);
---
INSERT INTO `keluhan` (`idpelanggan`, `keluhan`, `penyebab`, `tindakan`, `tgl_keluhan`, `tgl_perbaikan`) VALUES ('23', 'sadsa', 'asda', 'asda', '2022-04-07', '2022-04-08')